cmsis-svd/cmsis-svd/data/NXP/MKE16Z4.svd
        <register>
          <name>REIDR3</name>
          <description>Receive Extended Identifier Register 3</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RERTR</name>
              <description>Remote Transmission Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RERTR_0</name>
                  <description>Data frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RERTR_1</name>
                  <description>Remote frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REID6_REID0</name>
              <description>Extended Format Identifier 6-0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>REDSR%s</name>
          <description>Receive Extended Data Segment Register N</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RDB</name>
              <description>Data Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDLR</name>
          <description>Receive Data Length Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RDLC</name>
              <description>Data Length Code Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDLC_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDLC_8</name>
                  <description>8</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSRH</name>
          <description>Receive Time Stamp Register High</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RTS</name>
              <description>Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSRL</name>
          <description>Receive Time Stamp Register Low</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RTS</name>
              <description>Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEIDR0</name>
          <description>Transmit Extended Identifier Register 0</description>
          <alternateGroup>TEIDR0_TSIDR0</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TEID28_TEID21</name>
              <description>Extended Format Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSIDR0</name>
          <description>Transmit Standard Identifier Register 0</description>
          <alternateGroup>TEIDR0_TSIDR0</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TSID10_TSID3</name>
              <description>Standard Format Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEIDR1</name>
          <description>Transmit Extended Identifier Register 1</description>
          <alternateGroup>TEIDR1_TSIDR1</alternateGroup>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TEID17_TEID15</name>
              <description>Extended Format Identifier 17-15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIDE</name>
              <description>ID Extended</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEIDE_0</name>
                  <description>Standard format (11 bit).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEIDE_1</name>
                  <description>Extended format (29 bit).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSRR</name>
              <description>Substitute Remote Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEID20_TEID18</name>
              <description>Extended Format Identifier 20-18</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSIDR1</name>
          <description>Transmit Standard Identifier Register 1</description>
          <alternateGroup>TEIDR1_TSIDR1</alternateGroup>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TSIDE</name>
              <description>ID Extended</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSIDE_0</name>
                  <description>Standard format (11 bit).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSIDE_1</name>
                  <description>Extended format (29 bit).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSRTR</name>
              <description>Remote Transmission Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSRTR_0</name>
                  <description>Data frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSRTR_1</name>
                  <description>Remote frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSID2_TSID0</name>
              <description>Standard Format Identifier 2-0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEIDR2</name>
          <description>Transmit Extended Identifier Register 2</description>
          <addressOffset>0x32</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TEID14_TEID7</name>
              <description>Extended Format Identifier 14-7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEIDR3</name>
          <description>Transmit Extended Identifier Register 3</description>
          <addressOffset>0x33</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TERTR</name>
              <description>Remote Transmission Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TERTR_0</name>
                  <description>Data frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERTR_1</name>
                  <description>Remote frame.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEID6_TEID0</name>
              <description>Extended Format Identifier 6-0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>TEDSR%s</name>
          <description>Transmit Extended Data Segment Register N</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TDB</name>
              <description>Data Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDLR</name>
          <description>Transmit Data Length Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TDLC</name>
              <description>Data Length Code Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDLC_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDLC_8</name>
                  <description>8</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <description>Transmit Buffer Priority Register</description>
          <addressOffset>0x3D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRIO</name>
              <description>Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTSRH</name>
          <description>Transmit Time Stamp Register High</description>
          <addressOffset>0x3E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TTS</name>
              <description>Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTSRL</name>
          <description>Transmit Time Stamp Register Low</description>
          <addressOffset>0x3F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TTS</name>
              <description>Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
