cmsis-svd/cmsis-svd/data/NXP/MKE16Z4.svd
              <description>Port Toggle Output</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO24</name>
              <description>Port Toggle Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO25</name>
              <description>Port Toggle Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO26</name>
              <description>Port Toggle Output</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO27</name>
              <description>Port Toggle Output</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO28</name>
              <description>Port Toggle Output</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO29</name>
              <description>Port Toggle Output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO30</name>
              <description>Port Toggle Output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTTO31</name>
              <description>Port Toggle Output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTTO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTTO_1</name>
                  <description>Corresponding bit in PDORn is set to the inverse of its existing logic state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
